src/rpios/interrupt/linux.org
#+TITLE: Linux 实现
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../css/main.css" />
#+HTML_LINK_UP: ./rpi-os.html
#+HTML_LINK_HOME: ./interrupt.html
#+OPTIONS: num:nil timestamp:nil ^:nil

* 底层异常处理
#+begin_example
  如何在庞大的Linux内核源代码, 找到负责中断处理的代码？

  这里提出一个想法，向量表的基地址应存储在vbar_el1 寄存器中, 因此, 如果搜索 vbar_el1, 则应该能够弄清楚向量表的初始化位置
#+end_example

搜索提供了一些这个寄存器的用法, 其中之一属于已经熟悉的 head.S 。 这段代码位于__primary_switched 函数内部，MMU 打开后执行此函数：

#+begin_src asm 
	  adr_l    x8, vectors            // load VBAR_EL1 with virtual
	  msr    vbar_el1, x8            // vector table address
#+end_src

从这段代码中, 可以推断出 _向量表_ 被称为 _vector_ , 应该能够轻松找到 [[https://github.com/torvalds/linux/blob/v4.14/arch/arm64/kernel/entry.S#L367][定义]]

#+begin_src asm 
	  /*
	  ,* Exception vectors.
	  ,*/
	  .pushsection ".entry.text", "ax"

	  .align    11
	  ENTRY(vectors)
	  kernel_ventry    el1_sync_invalid        // Synchronous EL1t
	  kernel_ventry    el1_irq_invalid            // IRQ EL1t
	  kernel_ventry    el1_fiq_invalid            // FIQ EL1t
	  kernel_ventry    el1_error_invalid        // Error EL1t

	  kernel_ventry    el1_sync            // Synchronous EL1h
	  kernel_ventry    el1_irq                // IRQ EL1h
	  kernel_ventry    el1_fiq_invalid            // FIQ EL1h
	  kernel_ventry    el1_error_invalid        // Error EL1h

	  kernel_ventry    el0_sync            // Synchronous 64-bit EL0
	  kernel_ventry    el0_irq                // IRQ 64-bit EL0
	  kernel_ventry    el0_fiq_invalid            // FIQ 64-bit EL0
	  kernel_ventry    el0_error_invalid        // Error 64-bit EL0

	  #ifdef CONFIG_COMPAT
	  kernel_ventry    el0_sync_compat            // Synchronous 32-bit EL0
	  kernel_ventry    el0_irq_compat            // IRQ 32-bit EL0
	  kernel_ventry    el0_fiq_invalid_compat        // FIQ 32-bit EL0
	  kernel_ventry    el0_error_invalid_compat    // Error 32-bit EL0
	  #else
	  kernel_ventry    el0_sync_invalid        // Synchronous 32-bit EL0
	  kernel_ventry    el0_irq_invalid            // IRQ 32-bit EL0
	  kernel_ventry    el0_fiq_invalid            // FIQ 32-bit EL0
	  kernel_ventry    el0_error_invalid        // Error 32-bit EL0
	  #endif
	  END(vectors)
#+end_src

#+begin_example
  kernel_ventry宏与ventry在RPi OS中也有定义

  不过, 一个区别是 kernel_ventry 还负责检查是否发生了内核堆栈溢出

  如果设置了CONFIG_VMAP_STACK, 则启用此功能, 它是内核功能的一部分, 称为虚拟映射内核堆栈
#+end_example

