html/rpios/interrupt/linux.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linux 实现</title>
<meta name="author" content="Wu, Shanliang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./rpi-os.html"> UP </a>
 |
 <a accesskey="H" href="./interrupt.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Linux 实现</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga3acfc6">底层异常处理</a>
<ul>
<li><a href="#org652346c">kernel_entry</a></li>
<li><a href="#orgca433a8">el1_irq</a></li>
<li><a href="#orgf6111c0">小结</a></li>
</ul>
</li>
<li><a href="#org7107abb">中断控制器</a>
<ul>
<li><a href="#org9f8221a">使用设备树查找所需的设备和驱动程序</a></li>
<li><a href="#org5579e12">本地与全局中断控制器</a></li>
<li><a href="#org578790e">本地中断控制器</a></li>
<li><a href="#org57d933d">通用中断控制器</a></li>
</ul>
</li>
<li><a href="#org3a536e2">计时器</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga3acfc6" class="outline-2">
<h2 id="orga3acfc6">底层异常处理</h2>
<div class="outline-text-2" id="text-orga3acfc6">
<pre class="example" id="orgd642b1e">
如何在庞大的Linux内核源代码, 找到负责中断处理的代码？

这里提出一个想法，向量表的基地址应存储在vbar_el1 寄存器中, 因此, 如果搜索 vbar_el1, 则应该能够弄清楚向量表的初始化位置
</pre>

<p>
搜索提供了一些这个寄存器的用法, 其中之一属于已经熟悉的 head.S 。 这段代码位于__primary_switched 函数内部，MMU 打开后执行此函数：
</p>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #daa520; font-weight: bold;">adr_l</span>    <span style="color: #00bfff; font-weight: bold;">x8</span>, vectors            <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">load VBAR_EL1 with virtual</span>
<span style="color: #daa520; font-weight: bold;">msr</span>    <span style="color: #00bfff; font-weight: bold;">vbar</span>_el1, x8            <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">vector table address</span>
</pre>
</div>

<p>
从这段代码中, 可以推断出 <span class="underline">向量表</span> 被称为 <span class="underline">vector</span> , 应该能够轻松找到 <a href="https://github.com/torvalds/linux/blob/v4.14/arch/arm64/kernel/entry.S#L367">定义</a>
</p>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #5f9ea0; font-style: italic;">/*</span>
<span style="color: #5f9ea0; font-style: italic;">* Exception vectors.</span>
<span style="color: #5f9ea0; font-style: italic;">*/</span>
<span style="color: #00bfff; font-weight: bold;">.pushsection</span> <span style="color: #deb887;">".entry.text"</span>, <span style="color: #deb887;">"ax"</span>

<span style="color: #00bfff; font-weight: bold;">.align</span>    11
<span style="color: #daa520; font-weight: bold;">ENTRY</span>(vectors)
<span style="color: #daa520; font-weight: bold;">kernel_ventry</span>    <span style="color: #00bfff; font-weight: bold;">el1</span>_sync_invalid        <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Synchronous EL1t</span>
<span style="color: #daa520; font-weight: bold;">kernel_ventry</span>    <span style="color: #00bfff; font-weight: bold;">el1</span>_irq_invalid            <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">IRQ EL1t</span>
<span style="color: #daa520; font-weight: bold;">kernel_ventry</span>    <span style="color: #00bfff; font-weight: bold;">el1</span>_fiq_invalid            <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">FIQ EL1t</span>
<span style="color: #daa520; font-weight: bold;">kernel_ventry</span>    <span style="color: #00bfff; font-weight: bold;">el1</span>_error_invalid        <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Error EL1t</span>

<span style="color: #daa520; font-weight: bold;">kernel_ventry</span>    <span style="color: #00bfff; font-weight: bold;">el1</span>_sync            <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Synchronous EL1h</span>
<span style="color: #daa520; font-weight: bold;">kernel_ventry</span>    <span style="color: #00bfff; font-weight: bold;">el1</span>_irq                <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">IRQ EL1h</span>
<span style="color: #daa520; font-weight: bold;">kernel_ventry</span>    <span style="color: #00bfff; font-weight: bold;">el1</span>_fiq_invalid            <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">FIQ EL1h</span>
<span style="color: #daa520; font-weight: bold;">kernel_ventry</span>    <span style="color: #00bfff; font-weight: bold;">el1</span>_error_invalid        <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Error EL1h</span>

<span style="color: #daa520; font-weight: bold;">kernel_ventry</span>    <span style="color: #00bfff; font-weight: bold;">el0</span>_sync            <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Synchronous 64-bit EL0</span>
<span style="color: #daa520; font-weight: bold;">kernel_ventry</span>    <span style="color: #00bfff; font-weight: bold;">el0</span>_irq                <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">IRQ 64-bit EL0</span>
<span style="color: #daa520; font-weight: bold;">kernel_ventry</span>    <span style="color: #00bfff; font-weight: bold;">el0</span>_fiq_invalid            <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">FIQ 64-bit EL0</span>
<span style="color: #daa520; font-weight: bold;">kernel_ventry</span>    <span style="color: #00bfff; font-weight: bold;">el0</span>_error_invalid        <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Error 64-bit EL0</span>

<span style="color: #ffd700;">#ifdef</span> <span style="color: #4eee94;">CONFIG_COMPAT</span>
<span style="color: #daa520; font-weight: bold;">kernel_ventry</span>    <span style="color: #00bfff; font-weight: bold;">el0</span>_sync_compat            <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Synchronous 32-bit EL0</span>
<span style="color: #daa520; font-weight: bold;">kernel_ventry</span>    <span style="color: #00bfff; font-weight: bold;">el0</span>_irq_compat            <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">IRQ 32-bit EL0</span>
<span style="color: #daa520; font-weight: bold;">kernel_ventry</span>    <span style="color: #00bfff; font-weight: bold;">el0</span>_fiq_invalid_compat        <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">FIQ 32-bit EL0</span>
<span style="color: #daa520; font-weight: bold;">kernel_ventry</span>    <span style="color: #00bfff; font-weight: bold;">el0</span>_error_invalid_compat    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Error 32-bit EL0</span>
<span style="color: #ffd700;">#else</span>
<span style="color: #daa520; font-weight: bold;">kernel_ventry</span>    <span style="color: #00bfff; font-weight: bold;">el0</span>_sync_invalid        <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Synchronous 32-bit EL0</span>
<span style="color: #daa520; font-weight: bold;">kernel_ventry</span>    <span style="color: #00bfff; font-weight: bold;">el0</span>_irq_invalid            <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">IRQ 32-bit EL0</span>
<span style="color: #daa520; font-weight: bold;">kernel_ventry</span>    <span style="color: #00bfff; font-weight: bold;">el0</span>_fiq_invalid            <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">FIQ 32-bit EL0</span>
<span style="color: #daa520; font-weight: bold;">kernel_ventry</span>    <span style="color: #00bfff; font-weight: bold;">el0</span>_error_invalid        <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Error 32-bit EL0</span>
<span style="color: #ffd700;">#endif</span>
<span style="color: #daa520; font-weight: bold;">END</span>(vectors)
</pre>
</div>

<pre class="example" id="org09fd5d4">
kernel_ventry宏与ventry在RPi OS中也有定义

不过, 一个区别是 kernel_ventry 还负责检查是否发生了内核堆栈溢出

如果设置了CONFIG_VMAP_STACK, 则启用此功能, 它是内核功能的一部分, 称为虚拟映射内核堆栈
</pre>
</div>
