html/rpios/interrupt/linux.html

<div id="outline-container-org652346c" class="outline-3">
<h3 id="org652346c">kernel_entry</h3>
<div class="outline-text-3" id="text-org652346c">
<p>
kernel_entry宏 在 Linux 里要复杂得多：
</p>

<div class="org-src-container">
<pre class="src src-asm">        <span style="color: #00bfff; font-weight: bold;">.macro</span>  kernel_entry, el, regsize = 64
        <span style="color: #00bfff; font-weight: bold;">.if</span>     \regsize == 32
        <span style="color: #00bfff; font-weight: bold;">mov</span>     w0, w0                          <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">zero upper 32 bits of x0</span>
        <span style="color: #00bfff; font-weight: bold;">.endif</span>
        <span style="color: #00bfff; font-weight: bold;">stp</span>     x0, x1, [sp, #16 * 0]
        <span style="color: #00bfff; font-weight: bold;">stp</span>     x2, x3, [sp, #16 * 1]
        <span style="color: #00bfff; font-weight: bold;">stp</span>     x4, x5, [sp, #16 * 2]
        <span style="color: #00bfff; font-weight: bold;">stp</span>     x6, x7, [sp, #16 * 3]
        <span style="color: #00bfff; font-weight: bold;">stp</span>     x8, x9, [sp, #16 * 4]
        <span style="color: #00bfff; font-weight: bold;">stp</span>     x10, x11, [sp, #16 * 5]
        <span style="color: #00bfff; font-weight: bold;">stp</span>     x12, x13, [sp, #16 * 6]
        <span style="color: #00bfff; font-weight: bold;">stp</span>     x14, x15, [sp, #16 * 7]
        <span style="color: #00bfff; font-weight: bold;">stp</span>     x16, x17, [sp, #16 * 8]
        <span style="color: #00bfff; font-weight: bold;">stp</span>     x18, x19, [sp, #16 * 9]
        <span style="color: #00bfff; font-weight: bold;">stp</span>     x20, x21, [sp, #16 * 10]
        <span style="color: #00bfff; font-weight: bold;">stp</span>     x22, x23, [sp, #16 * 11]
        <span style="color: #00bfff; font-weight: bold;">stp</span>     x24, x25, [sp, #16 * 12]
        <span style="color: #00bfff; font-weight: bold;">stp</span>     x26, x27, [sp, #16 * 13]
        <span style="color: #00bfff; font-weight: bold;">stp</span>     x28, x29, [sp, #16 * 14]

        <span style="color: #00bfff; font-weight: bold;">.if</span>     \el == 0
        <span style="color: #00bfff; font-weight: bold;">mrs</span>     x21, sp_el0
        <span style="color: #00bfff; font-weight: bold;">ldr_this_cpu</span>    tsk, __entry_task, x20  <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Ensure MDSCR_EL1.SS is clear,</span>
        <span style="color: #00bfff; font-weight: bold;">ldr</span>     x19, [tsk, #TSK_TI_FLAGS]       <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">since we can unmask debug</span>
        <span style="color: #00bfff; font-weight: bold;">disable_step_tsk</span> x19, x20               <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">exceptions when scheduling.</span>

        <span style="color: #00bfff; font-weight: bold;">mov</span>     x29, xzr                        <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">fp pointed to user-space</span>
        <span style="color: #00bfff; font-weight: bold;">.else</span>
        <span style="color: #00bfff; font-weight: bold;">add</span>     x21, sp, #S_FRAME_SIZE
        <span style="color: #00bfff; font-weight: bold;">get_thread_info</span> tsk
        <span style="color: #5f9ea0; font-style: italic;">/* </span><span style="color: #5f9ea0; font-style: italic;">Save the task's original addr_limit and set USER_DS (TASK_SIZE_64)</span><span style="color: #5f9ea0; font-style: italic;"> */</span>
        <span style="color: #00bfff; font-weight: bold;">ldr</span>     x20, [tsk, #TSK_TI_ADDR_LIMIT]
        <span style="color: #00bfff; font-weight: bold;">str</span>     x20, [sp, #S_ORIG_ADDR_LIMIT]
        <span style="color: #00bfff; font-weight: bold;">mov</span>     x20, #TASK_SIZE_64
        <span style="color: #00bfff; font-weight: bold;">str</span>     x20, [tsk, #TSK_TI_ADDR_LIMIT]
        <span style="color: #5f9ea0; font-style: italic;">/* </span><span style="color: #5f9ea0; font-style: italic;">No need to reset PSTATE.UAO, hardware's already set it to 0 for us</span><span style="color: #5f9ea0; font-style: italic;"> */</span>
        <span style="color: #00bfff; font-weight: bold;">.endif</span> <span style="color: #5f9ea0; font-style: italic;">/* </span><span style="color: #5f9ea0; font-style: italic;">\el == 0</span><span style="color: #5f9ea0; font-style: italic;"> */</span>
        <span style="color: #00bfff; font-weight: bold;">mrs</span>     x22, elr_el1
        <span style="color: #00bfff; font-weight: bold;">mrs</span>     x23, spsr_el1
        <span style="color: #00bfff; font-weight: bold;">stp</span>     lr, x21, [sp, #S_LR]

        <span style="color: #5f9ea0; font-style: italic;">/*</span>
<span style="color: #5f9ea0; font-style: italic;">        * In order to be able to dump the contents of struct pt_regs at the</span>
<span style="color: #5f9ea0; font-style: italic;">        * time the exception was taken (in case we attempt to walk the call</span>
<span style="color: #5f9ea0; font-style: italic;">        * stack later), chain it together with the stack frames.</span>
<span style="color: #5f9ea0; font-style: italic;">        */</span>
        <span style="color: #00bfff; font-weight: bold;">.if</span> \el == 0
        <span style="color: #00bfff; font-weight: bold;">stp</span>     xzr, xzr, [sp, #S_STACKFRAME]
        <span style="color: #00bfff; font-weight: bold;">.else</span>
        <span style="color: #00bfff; font-weight: bold;">stp</span>     x29, x22, [sp, #S_STACKFRAME]
        <span style="color: #00bfff; font-weight: bold;">.endif</span>
        <span style="color: #00bfff; font-weight: bold;">add</span>     x29, sp, #S_STACKFRAME

        #ifdef CONFIG_ARM64_SW_TTBR0_PAN
        <span style="color: #5f9ea0; font-style: italic;">/*</span>
<span style="color: #5f9ea0; font-style: italic;">        * Set the TTBR0 PAN bit in SPSR. When the exception is taken from</span>
<span style="color: #5f9ea0; font-style: italic;">        * EL0, there is no need to check the state of TTBR0_EL1 since</span>
<span style="color: #5f9ea0; font-style: italic;">        * accesses are always enabled.</span>
<span style="color: #5f9ea0; font-style: italic;">        * Note that the meaning of this bit differs from the ARMv8.1 PAN</span>
<span style="color: #5f9ea0; font-style: italic;">        * feature as all TTBR0_EL1 accesses are disabled, not just those to</span>
<span style="color: #5f9ea0; font-style: italic;">        * user mappings.</span>
<span style="color: #5f9ea0; font-style: italic;">        */</span>
        <span style="color: #00bfff; font-weight: bold;">alternative_if</span> ARM64_HAS_PAN
        <span style="color: #00bfff; font-weight: bold;">b</span>       1f                              <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">skip TTBR0 PAN</span>
        <span style="color: #00bfff; font-weight: bold;">alternative_else_nop_endif</span>

        <span style="color: #00bfff; font-weight: bold;">.if</span>     \el != 0
        <span style="color: #00bfff; font-weight: bold;">mrs</span>     x21, ttbr0_el1
        <span style="color: #00bfff; font-weight: bold;">tst</span>     x21, #0xffff &lt;&lt; 48              <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Check for the reserved ASID</span>
        <span style="color: #00bfff; font-weight: bold;">orr</span>     x23, x23, #PSR_PAN_BIT          <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Set the emulated PAN in the saved SPSR</span>
        <span style="color: #00bfff; font-weight: bold;">b.eq</span>    1f                              <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">TTBR0 access already disabled</span>
        <span style="color: #00bfff; font-weight: bold;">and</span>     x23, x23, #~PSR_PAN_BIT         <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Clear the emulated PAN in the saved SPSR</span>
        <span style="color: #00bfff; font-weight: bold;">.endif</span>

        <span style="color: #00bfff; font-weight: bold;">__uaccess_ttbr0_disable</span> x21
<span style="color: #daa520; font-weight: bold;">1</span>:
        #endif

        <span style="color: #00bfff; font-weight: bold;">stp</span>     x22, x23, [sp, #S_PC]

        <span style="color: #5f9ea0; font-style: italic;">/* </span><span style="color: #5f9ea0; font-style: italic;">Not in a syscall by default (el0_svc overwrites for real syscall)</span><span style="color: #5f9ea0; font-style: italic;"> */</span>
        <span style="color: #00bfff; font-weight: bold;">.if</span>     \el == 0
        <span style="color: #00bfff; font-weight: bold;">mov</span>     w21, #NO_SYSCALL
        <span style="color: #00bfff; font-weight: bold;">str</span>     w21, [sp, #S_SYSCALLNO]
        <span style="color: #00bfff; font-weight: bold;">.endif</span>

        <span style="color: #5f9ea0; font-style: italic;">/*</span>
<span style="color: #5f9ea0; font-style: italic;">        * Set sp_el0 to current thread_info.</span>
<span style="color: #5f9ea0; font-style: italic;">        */</span>
        <span style="color: #00bfff; font-weight: bold;">.if</span>     \el == 0
        <span style="color: #00bfff; font-weight: bold;">msr</span>     sp_el0, tsk
        <span style="color: #00bfff; font-weight: bold;">.endif</span>

        <span style="color: #5f9ea0; font-style: italic;">/*</span>
<span style="color: #5f9ea0; font-style: italic;">        * Registers that may be useful after this macro is invoked:</span>
<span style="color: #5f9ea0; font-style: italic;">        *</span>
<span style="color: #5f9ea0; font-style: italic;">        * x21 - aborted SP</span>
<span style="color: #5f9ea0; font-style: italic;">        * x22 - aborted PC</span>
<span style="color: #5f9ea0; font-style: italic;">        * x23 - aborted PSTATE</span>
<span style="color: #5f9ea0; font-style: italic;">        */</span>
        <span style="color: #00bfff; font-weight: bold;">.endm</span>
</pre>
</div>

<p>
现在来详细研究这个宏
</p>
<div class="org-src-container">
<pre class="src src-asm"><span style="color: #00bfff; font-weight: bold;">.macro</span>    kernel_entry, el, regsize = 64
</pre>
</div>

<p>
该宏接受2个参数： <span class="underline">el</span> 和 <span class="underline">regsize</span> :
</p>
<ul class="org-ul">
<li>el 可以是 0 或 1, 具体取决于是否在EL0或EL1上生成了异常</li>
<li>如果来自32位EL0, 则 regsize 为32, 否则为64</li>
</ul>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #00bfff; font-weight: bold;">.if</span>    \regsize == 32
<span style="color: #daa520; font-weight: bold;">mov</span>    <span style="color: #00bfff; font-weight: bold;">w0</span>, w0                <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">zero upper 32 bits of x0</span>
<span style="color: #00bfff; font-weight: bold;">.endif</span>
</pre>
</div>

<p>
在32位模式下, 使用32位通用寄存器(w0而不是x0)。w0在结构上映射到x0的下部
</p>

<pre class="example" id="org6a1bf36">
上面代码通过向自身写入w0来将x0寄存器的高32位清零
</pre>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #daa520; font-weight: bold;">stp</span>    <span style="color: #00bfff; font-weight: bold;">x0</span>, x1, [sp, #16 * 0]
<span style="color: #daa520; font-weight: bold;">stp</span>    <span style="color: #00bfff; font-weight: bold;">x2</span>, x3, [sp, #16 * 1]
<span style="color: #daa520; font-weight: bold;">stp</span>    <span style="color: #00bfff; font-weight: bold;">x4</span>, x5, [sp, #16 * 2]
<span style="color: #daa520; font-weight: bold;">stp</span>    <span style="color: #00bfff; font-weight: bold;">x6</span>, x7, [sp, #16 * 3]
<span style="color: #daa520; font-weight: bold;">stp</span>    <span style="color: #00bfff; font-weight: bold;">x8</span>, x9, [sp, #16 * 4]
<span style="color: #daa520; font-weight: bold;">stp</span>    <span style="color: #00bfff; font-weight: bold;">x10</span>, x11, [sp, #16 * 5]
<span style="color: #daa520; font-weight: bold;">stp</span>    <span style="color: #00bfff; font-weight: bold;">x12</span>, x13, [sp, #16 * 6]
<span style="color: #daa520; font-weight: bold;">stp</span>    <span style="color: #00bfff; font-weight: bold;">x14</span>, x15, [sp, #16 * 7]
<span style="color: #daa520; font-weight: bold;">stp</span>    <span style="color: #00bfff; font-weight: bold;">x16</span>, x17, [sp, #16 * 8]
<span style="color: #daa520; font-weight: bold;">stp</span>    <span style="color: #00bfff; font-weight: bold;">x18</span>, x19, [sp, #16 * 9]
<span style="color: #daa520; font-weight: bold;">stp</span>    <span style="color: #00bfff; font-weight: bold;">x20</span>, x21, [sp, #16 * 10]
<span style="color: #daa520; font-weight: bold;">stp</span>    <span style="color: #00bfff; font-weight: bold;">x22</span>, x23, [sp, #16 * 11]
<span style="color: #daa520; font-weight: bold;">stp</span>    <span style="color: #00bfff; font-weight: bold;">x24</span>, x25, [sp, #16 * 12]
<span style="color: #daa520; font-weight: bold;">stp</span>    <span style="color: #00bfff; font-weight: bold;">x26</span>, x27, [sp, #16 * 13]
<span style="color: #daa520; font-weight: bold;">stp</span>    <span style="color: #00bfff; font-weight: bold;">x28</span>, x29, [sp, #16 * 14]
</pre>
</div>

<p>
将所有通用寄存器保存在堆栈中
</p>

<pre class="example" id="org6e31d7b">
请注意：在 kernel_ventry 中已经对堆栈指针进行了调整, 以适应所有需要被存储

保存寄存器的顺序很重要, 因为在Linux中有一种特殊的结构pt_regs, 用于稍后在异常处理程序中访问保存的寄存器

该结构不仅包含通用寄存器, 还包含其他一些信息, 这些信息大多数稍后会在kernel_entry宏中填充
</pre>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #00bfff; font-weight: bold;">.if</span>    \el == 0
<span style="color: #daa520; font-weight: bold;">mrs</span>    <span style="color: #00bfff; font-weight: bold;">x21</span>, sp_el0
</pre>
</div>

<p>
<span class="underline">x21</span> 现在包含被异常的堆栈指针
</p>

<pre class="example" id="org75b260d">
请注意, Linux中的一个进程对于用户和内核模式分别使用不同的堆栈

在用户模式下, 可以使用 sp_el0 寄存器来计算异常产生时的堆栈指针值

这行非常重要, 因为需要在上下文切换期间交换堆栈指针
</pre>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #daa520; font-weight: bold;">ldr_this_cpu</span>    <span style="color: #00bfff; font-weight: bold;">tsk</span>, __entry_task, x20    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Ensure MDSCR_EL1.SS is clear,</span>
<span style="color: #daa520; font-weight: bold;">ldr</span>    <span style="color: #00bfff; font-weight: bold;">x19</span>, [tsk, #TSK_TI_FLAGS]    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">since we can unmask debug</span>
<span style="color: #daa520; font-weight: bold;">disable_step_tsk</span> <span style="color: #00bfff; font-weight: bold;">x19</span>, x20        <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">exceptions when scheduling.</span>
</pre>
</div>
<p>
<span class="underline">MDSCR_EL1.SS</span> 位负责启用 <b>软件步骤异常</b> ：如果该位 <span class="underline">置1</span> 并且调试异常未屏蔽, 则在执行任何指令后都会生成异常
</p>
<pre class="example" id="orgb4fca9b">
这是调试器通常使用的
</pre>

<p>
从用户模式获取异常时, 需要首先检查 <a href="https://github.com/torvalds/linux/blob/v4.14/arch/arm64/include/asm/thread_info.h#L93">TIF_SINGLESTEP</a> 标志为当前任务设置. 如果是, 则表明任务正在调试器下执行, 必须将 MDSCR_EL1.SS位清零
</p>

<pre class="example" id="org4b6c13d">
在Linux中, 每个进程或线程(稍后都会将它们称为“任务”)都有一个 task_struct 与其关联，该结构包含有关任务的所有元数据信息

在arm64体系结构上task_struct中被放入另一个称为thread_info, 所以可以通过指向task_struct的指针来获取指向thread_info的指针

thread_info 存储了很多底层值和标志位，这些会被 entry.S 所访问
</pre>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #daa520; font-weight: bold;">mov</span>    <span style="color: #00bfff; font-weight: bold;">x29</span>, xzr            <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">fp pointed to user-space</span>
</pre>
</div>

<p>
尽管 <span class="underline">x29</span> 是通用寄存器, 但通常具有特殊含义，它用作 <b>frame pointer</b> 。编译函数时, 通常：
</p>

<ol class="org-ol">
<li>在堆栈中存储旧的帧指针和链接寄存器值，x30被称为链接寄存器, 它包含一个由ret指令使用的“返回地址”</li>
<li>然后分配一个新的堆栈帧, 以便它可以包含函数的所有局部变量, 并且帧指针寄存器设置为指向帧的底部</li>
</ol>

<p>
每当函数需要访问某些局部变量时, 它仅向帧指针添加硬编码的偏移量
</p>

<pre class="example" id="org4094ab9">
现在想象一下发生了一个错误, 需要生成一个堆栈跟踪：

可以使用当前帧指针在堆栈中查找所有局部变量, 并且可以使用链接寄存器来确定调用者的确切位置

接下来, 利用以下事实：旧的帧指针和链接寄存器的值始终保存在堆栈帧的开头, 而我们可以从那里读取它们。一旦获取了调用者的帧指针之后, 现在反过来也可以访问调用者所有的局部变量

不断递归地重复此过程, 直到到达堆栈顶部为止, 这称为“堆栈展开”。事实上 ptrace 系统调用就是使用了类似的算法
</pre>

<p>
现在, 回到 kernel_entry 宏, 就很清楚为什么在从EL0中获取异常后需要清除x29寄存器。这是因为在Linux中, 每个任务在用户和内核模式下都使用不同的堆栈, 因此拥有通用堆栈跟踪没有任何意义
</p>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #00bfff; font-weight: bold;">.else</span>
<span style="color: #daa520; font-weight: bold;">add</span>    <span style="color: #00bfff; font-weight: bold;">x21</span>, sp, #S_FRAME_SIZE
</pre>
</div>

<p>
在 else子句中, 这意味着仅当处理从EL1提取的异常时, 在这种情况下, 将重用旧堆栈, 所以将 <span class="underline">原始sp值</span> <b>保存</b> 在 <span class="underline">x21寄存器</span> 中, 以备后用 
</p>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #5f9ea0; font-style: italic;">/* </span><span style="color: #5f9ea0; font-style: italic;">Save the task's original addr_limit and set USER_DS (TASK_SIZE_64)</span><span style="color: #5f9ea0; font-style: italic;"> */</span>
<span style="color: #daa520; font-weight: bold;">ldr</span>    <span style="color: #00bfff; font-weight: bold;">x20</span>, [tsk, #TSK_TI_ADDR_LIMIT]
<span style="color: #daa520; font-weight: bold;">str</span>    <span style="color: #00bfff; font-weight: bold;">x20</span>, [sp, #S_ORIG_ADDR_LIMIT]
<span style="color: #daa520; font-weight: bold;">mov</span>    <span style="color: #00bfff; font-weight: bold;">x20</span>, #TASK_SIZE_64
<span style="color: #daa520; font-weight: bold;">str</span>    <span style="color: #00bfff; font-weight: bold;">x20</span>, [tsk, #TSK_TI_ADDR_LIMIT]
</pre>
</div>

<p>
任务的 <span class="underline">内存地址限制</span> 指定了可以使用的最大虚拟内存地址：
</p>
<ul class="org-ul">
<li>当用户进程以32位模式运行时, 此限制为 2^32</li>
<li>对于64位内核, 它可以更大, 通常为2^48</li>
</ul>

<p>
如果碰巧从32位EL1中获取了异常, 则需要将此限制更改为 <span class="underline">TASK_SIZE_64</span> 。此外, 还需要保存原始限制, 因为需要先还原该限制, 然后才能将执行返回到用户模式
</p>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #daa520; font-weight: bold;">mrs</span>    <span style="color: #00bfff; font-weight: bold;">x22</span>, elr_el1
<span style="color: #daa520; font-weight: bold;">mrs</span>    <span style="color: #00bfff; font-weight: bold;">x23</span>, spsr_el1
</pre>
</div>

<p>
在开始处理异常之前, 必须先将 <span class="underline">elr_el1</span> 和 <span class="underline">spsr_el1</span> 保存在堆栈中
</p>

<pre class="example" id="org60b438d">
尚未在RPI OS中完成此操作, 因为到目前为止, 始终返回到发生异常的位置

但是, 如果需要在处理异常时进行上下文切换, 就需要执行这些操作
</pre>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #daa520; font-weight: bold;">stp</span>    <span style="color: #00bfff; font-weight: bold;">lr</span>, x21, [sp, #S_LR]
</pre>
</div>

<p>
把 <span class="underline">链接寄存器</span> 和 <span class="underline">帧指针寄存器</span> 保存在堆栈中
</p>

<pre class="example" id="org4abfd09">
已经知道, 根据是从EL0还是从EL1提取异常, 帧指针的计算方式有所不同, 并且该计算的结果已存储在x21寄存器中
</pre>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #5f9ea0; font-style: italic;">/*</span>
<span style="color: #5f9ea0; font-style: italic;">* In order to be able to dump the contents of struct pt_regs at the</span>
<span style="color: #5f9ea0; font-style: italic;">* time the exception was taken (in case we attempt to walk the call</span>
<span style="color: #5f9ea0; font-style: italic;">* stack later), chain it together with the stack frames.</span>
<span style="color: #5f9ea0; font-style: italic;">*/</span>
<span style="color: #00bfff; font-weight: bold;">.if</span> \el == 0
<span style="color: #daa520; font-weight: bold;">stp</span>    <span style="color: #00bfff; font-weight: bold;">xzr</span>, xzr, [sp, #S_STACKFRAME]
<span style="color: #00bfff; font-weight: bold;">.else</span>
<span style="color: #daa520; font-weight: bold;">stp</span>    <span style="color: #00bfff; font-weight: bold;">x29</span>, x22, [sp, #S_STACKFRAME]
<span style="color: #00bfff; font-weight: bold;">.endif</span>
<span style="color: #daa520; font-weight: bold;">add</span>    <span style="color: #00bfff; font-weight: bold;">x29</span>, sp, #S_STACKFRAME
</pre>
</div>

<p>
这里填充了 <span class="underline">pt_regs</span> 结构的 <b>stackframe 属性</b>
</p>

<pre class="example" id="org2dcc105">
stackframe 属性还包含链接寄存器和帧指针, 尽管这里使用的是 elr_el1 的值(现在位于 x22 中) 而不是 lr

stackframe 一般只用于 堆栈回溯 
</pre>

<div class="org-src-container">
<pre class="src src-asm">        #ifdef CONFIG_ARM64_SW_TTBR0_PAN
        <span style="color: #00bfff; font-weight: bold;">alternative_if</span> ARM64_HAS_PAN
        <span style="color: #00bfff; font-weight: bold;">b</span>    1f                <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">skip TTBR0 PAN</span>
        <span style="color: #00bfff; font-weight: bold;">alternative_else_nop_endif</span>

        <span style="color: #00bfff; font-weight: bold;">.if</span>    \el != 0
        <span style="color: #00bfff; font-weight: bold;">mrs</span>    x21, ttbr0_el1
        <span style="color: #00bfff; font-weight: bold;">tst</span>    x21, #0xffff &lt;&lt; 48        <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Check for the reserved ASID</span>
        <span style="color: #00bfff; font-weight: bold;">orr</span>    x23, x23, #PSR_PAN_BIT        <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Set the emulated PAN in the saved SPSR</span>
        <span style="color: #00bfff; font-weight: bold;">b.eq</span>    1f                <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">TTBR0 access already disabled</span>
        <span style="color: #00bfff; font-weight: bold;">and</span>    x23, x23, #~PSR_PAN_BIT        <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">Clear the emulated PAN in the saved SPSR</span>
        <span style="color: #00bfff; font-weight: bold;">.endif</span>

        <span style="color: #00bfff; font-weight: bold;">__uaccess_ttbr0_disable</span> x21
<span style="color: #daa520; font-weight: bold;">1</span>:
        #endif
</pre>
</div>

<p>
<span class="underline">CONFIG_ARM64_SW_TTBR0_PAN</span> 参数禁止内核直接访问用户空间内存
</p>

<pre class="example" id="org7d094b7">
跳过对此工作原理的详细说明, 因为此类安全功能对于讨论而言已超出范围
</pre>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #daa520; font-weight: bold;">stp</span>    <span style="color: #00bfff; font-weight: bold;">x22</span>, x23, [sp, #S_PC]
</pre>
</div>

<p>
这里, <span class="underline">elr_el1</span> (x22) 和 <span class="underline">spsr_el1</span> (x23) 被保存在堆栈中 
</p>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #5f9ea0; font-style: italic;">/* </span><span style="color: #5f9ea0; font-style: italic;">Not in a syscall by default (el0_svc overwrites for real syscall)</span><span style="color: #5f9ea0; font-style: italic;"> */</span>
<span style="color: #00bfff; font-weight: bold;">.if</span>    \el == 0
<span style="color: #daa520; font-weight: bold;">mov</span>    <span style="color: #00bfff; font-weight: bold;">w21</span>, #NO_SYSCALL
<span style="color: #daa520; font-weight: bold;">str</span>    <span style="color: #00bfff; font-weight: bold;">w21</span>, [sp, #S_SYSCALLNO]
<span style="color: #00bfff; font-weight: bold;">.endif</span>
</pre>
</div>

<p>
pt_regs结构体有一个field, 指示当前异常是否为 <span class="underline">系统调用</span> (syscall)
</p>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #5f9ea0; font-style: italic;">/*</span>
<span style="color: #5f9ea0; font-style: italic;">* Set sp_el0 to current thread_info.</span>
<span style="color: #5f9ea0; font-style: italic;">*/</span>
<span style="color: #00bfff; font-weight: bold;">.if</span>    \el == 0
<span style="color: #daa520; font-weight: bold;">msr</span>    <span style="color: #00bfff; font-weight: bold;">sp</span>_el0, tsk
<span style="color: #00bfff; font-weight: bold;">.endif</span>
</pre>
</div>

<p>
在内核模式下执行任务时, 不需要 <span class="underline">sp_el0</span>
</p>

<pre class="example" id="orgedc195e">
.其值先前已保存在堆栈中, 因此可以在kernel_exit宏中轻松恢复
</pre>

<p>
从现在开始, sp_el0将用于持有 <b>指向</b> <span class="underline">当前task_struct</span> 的 <span class="underline">指针</span> 
</p>
</div>
</div>
