src/rpios/interrupt/linux.org
** el1_irq 
接下来要研究的是负责处理从EL1提取的IRQ的处理程序。在向量表中, 可以轻松地发现该处理程序称为 _el1_irq_ 并在 [[https://github.com/torvalds/linux/blob/v4.14/arch/arm64/kernel/entry.S#L562][此处]] 定义：

#+begin_src asm 
  el1_irq:
	  kernel_entry 1
	  enable_dbg
	  #ifdef CONFIG_TRACE_IRQFLAGS
	  bl    trace_hardirqs_off
	  #endif

	  irq_handler

	  #ifdef CONFIG_PREEMPT
	  ldr    w24, [tsk, #TSK_TI_PREEMPT]    // get preempt count
	  cbnz    w24, 1f                // preempt count != 0
	  ldr    x0, [tsk, #TSK_TI_FLAGS]    // get flags
	  tbz    x0, #TIF_NEED_RESCHED, 1f    // needs rescheduling?
	  bl    el1_preempt
  1:
	  #endif
	  #ifdef CONFIG_TRACE_IRQFLAGS
	  bl    trace_hardirqs_on
	  #endif
	  kernel_exit 1
	  ENDPROC(el1_irq)
#+end_src

在此函数内部执行以下操作：
1. 调用 _kernel_entry_ 和 _kernel_exit_ 宏来保存和恢复处理器状态：
   + 第一个参数指示异常来自EL1
2. 调用 _enable_dbg宏_ 可以 *取消屏蔽* _调试中断_
   #+begin_example
     此时, 这样做是安全的, 因为已经保存了处理器状态, 即使在中断处理程序的中间发生了调试异常, 也可以正确处理它
   #+end_example
3. _#ifdef CONFIG_TRACE_IRQFLAGS_ 块中的代码负责 *跟踪* _中断_ . 它记录2个事件：中断开始和结束
4. _#ifdef CONFIG_PREEMPT_ 中的代码 *阻止访问* _当前任务标志_ , 以检查是否需要调用调度程序
5. _irq_handler_ : 这是执行实际中断处理的地方 

irq_handler 是一个宏, 定义如下.

#+begin_src asm 
	  .macro    irq_handler
	  ldr_l    x1, handle_arch_irq
	  mov    x0, sp
	  irq_stack_entry
	  blr    x1
	  irq_stack_exit
	  .endm
#+end_src

irq_handler执行 _handle_arch_irq_ 函数，该函数通过特殊的堆栈( _irq堆栈_ )执行

#+begin_example
  为什么有必要切换到其他堆栈？ 例如, 在RPI OS中, 没有这样做

  但是如果不这么做, 将使用当前任务堆栈来处理中断, 而且永远无法确定当前任务堆栈中还有多少空间可以留给中断处理程序
#+end_example

接下来, 需要查看 handle_arch_irq。虽然他看起来像一个变量，而不是一个函数，实际上他是一个函数指针，并在 [[https://github.com/torvalds/linux/blob/v4.14/arch/arm64/kernel/irq.c#L46][set_handle_irq]] 函数中设置

** 小结
#+begin_example
  至今为止已经研究了低级中断处理代码, 并从向量表一直跟踪到 handle_arch_irq ，这就是中断离开体系结构特定代码并开始由驱动程序代码处理的关键所在

  下一个目标是通过驱动程序代码来追踪计时器中断
#+end_example

* 中断控制器
#+begin_example
  接下来将大量讨论Linux驱动程序以及它们如何处理中断
#+end_example

先从驱动程序初始化代码开始, 然后看看 [[https://github.com/torvalds/linux/blob/v4.14/arch/arm64/kernel/irq.c#L44][handle_arch_irq]] 函数 

** 使用设备树查找所需的设备和驱动程序
#+begin_example
  在RPi OS中实现中断时, 一直在使用2种设备：系统定时器和中断控制器

  现在, 我们的目标是了解相同设备在Linux中的工作方式

  需要做的第一件事是找到负责使用提到的设备的驱动程序
#+end_example

为了找到所需的驱动程序, 可以使用 [[https://github.com/torvalds/linux/blob/v4.14/arch/arm/boot/dots/bcm2837-rpi-3-b.dts][bcm2837-rpi-3-b.dts]] 设备树文件：这是特定于Raspberry Pi 3 Model B的顶级设备树文件, 它包含其他更常见的设备树文件, 这些文件在不同版本的Raspberry Pi之间共享. 如果遵循包含的链并搜索 timer 和 interrupt-controller , 则可以找到4个设备：
+ [[https://github.com/torvalds/linux/blob/v4.14/arch/arm/boot/dts/bcm2837.dtsi#L11][本地中断控制器]]
+ [[https://github.com/torvalds/linux/blob/v4.14/arch/arm/boot/dts/bcm2837.dtsi#L20][本地计时器]]
+ 全局中断控制器. 它被定义在 [[https://github.com/torvalds/linux/blob/v4.14/arch/arm/boot/dts/bcm283x.dtsi#L109][这里]]
+ [[https://github.com/torvalds/linux/blob/v4.14/arch/arm/boot/dts/bcm283x.dtsi#L57][系统计时器]]

#+begin_example
  为什么有4个设备而不是2个？
#+end_example

** 本地与全局中断控制器
#+begin_example
  考虑多处理器系统中的中断处理时, 应该问自己几个问题：

  哪个内核应负责处理特定的中断？

  发生中断时, 是全部4个内核都中断了, 还是只有一个？

  是否可以将特定的中断路由到特定的内核？

  可能想知道的另一个问题是, 如果一个处理器需要向其传递一些信息, 该处理器如何通知另一个处理器？
#+end_example

_本地中断控制器_ 是可以帮助回答所有这些问题的设备，它负责以下任务：
+ 配置哪个内核应该接收特定的中断
+ 在内核之间发送中断. 这样的中断称为 _mailboxs_ , 并允许内核相互通信
+ 处理来自本地计时器和性能监视器中断(PMU)的中断

  #+begin_example
    BCM2836 ARM本地外围设备 手册中记录了本地中断控制器以及本地计时器的行为.

    为什么我们在系统中需要两个独立的计时器？使用本地计时器的主要用例是当要配置所有4个内核以同时接收计时器中断时。如果使用系统定时器, 则只能将中断路由到单个内核.

    使用RPi OS时, 既不使用本地中断控制器也不使用本地计时器：这是因为默认情况下, 本地中断控制器的配置方式是将所有外部中断都发送到第一个内核, 这正是我们所需要的. 所以没有使用本地计时器, 而是使用了系统计时器
  #+end_example

