html/rpios/interrupt/linux.html

<div id="outline-container-orgca433a8" class="outline-3">
<h3 id="orgca433a8">el1_irq</h3>
<div class="outline-text-3" id="text-orgca433a8">
<p>
接下来要研究的是负责处理从EL1提取的IRQ的处理程序。在向量表中, 可以轻松地发现该处理程序称为 <span class="underline">el1_irq</span> 并在 <a href="https://github.com/torvalds/linux/blob/v4.14/arch/arm64/kernel/entry.S#L562">此处</a> 定义：
</p>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #daa520; font-weight: bold;">el1_irq</span>:
        <span style="color: #00bfff; font-weight: bold;">kernel_entry</span> 1
        <span style="color: #00bfff; font-weight: bold;">enable_dbg</span>
        #ifdef CONFIG_TRACE_IRQFLAGS
        <span style="color: #00bfff; font-weight: bold;">bl</span>    trace_hardirqs_off
        #endif

        <span style="color: #00bfff; font-weight: bold;">irq_handler</span>

        #ifdef CONFIG_PREEMPT
        <span style="color: #00bfff; font-weight: bold;">ldr</span>    w24, [tsk, #TSK_TI_PREEMPT]    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">get preempt count</span>
        <span style="color: #00bfff; font-weight: bold;">cbnz</span>    w24, 1f                <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">preempt count != 0</span>
        <span style="color: #00bfff; font-weight: bold;">ldr</span>    x0, [tsk, #TSK_TI_FLAGS]    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">get flags</span>
        <span style="color: #00bfff; font-weight: bold;">tbz</span>    x0, #TIF_NEED_RESCHED, 1f    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">needs rescheduling?</span>
        <span style="color: #00bfff; font-weight: bold;">bl</span>    el1_preempt
<span style="color: #daa520; font-weight: bold;">1</span>:
        #endif
        #ifdef CONFIG_TRACE_IRQFLAGS
        <span style="color: #00bfff; font-weight: bold;">bl</span>    trace_hardirqs_on
        #endif
        <span style="color: #00bfff; font-weight: bold;">kernel_exit</span> 1
        <span style="color: #00bfff; font-weight: bold;">ENDPROC</span>(el1_irq)
</pre>
</div>

<p>
在此函数内部执行以下操作：
</p>
<ol class="org-ol">
<li>调用 <span class="underline">kernel_entry</span> 和 <span class="underline">kernel_exit</span> 宏来保存和恢复处理器状态：
<ul class="org-ul">
<li>第一个参数指示异常来自EL1</li>
</ul></li>
<li><p>
调用 <span class="underline">enable_dbg宏</span> 可以 <b>取消屏蔽</b> <span class="underline">调试中断</span>
</p>
<pre class="example" id="org56c1184">
此时, 这样做是安全的, 因为已经保存了处理器状态, 即使在中断处理程序的中间发生了调试异常, 也可以正确处理它
</pre></li>
<li><span class="underline">#ifdef CONFIG_TRACE_IRQFLAGS</span> 块中的代码负责 <b>跟踪</b> <span class="underline">中断</span> . 它记录2个事件：中断开始和结束</li>
<li><span class="underline">#ifdef CONFIG_PREEMPT</span> 中的代码 <b>阻止访问</b> <span class="underline">当前任务标志</span> , 以检查是否需要调用调度程序</li>
<li><span class="underline">irq_handler</span> : 这是执行实际中断处理的地方</li>
</ol>

<p>
irq_handler 是一个宏, 定义如下.
</p>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #00bfff; font-weight: bold;">.macro</span>    irq_handler
<span style="color: #daa520; font-weight: bold;">ldr_l</span>    <span style="color: #00bfff; font-weight: bold;">x1</span>, handle_arch_irq
<span style="color: #daa520; font-weight: bold;">mov</span>    <span style="color: #00bfff; font-weight: bold;">x0</span>, sp
<span style="color: #daa520; font-weight: bold;">irq_stack_entry</span>
<span style="color: #daa520; font-weight: bold;">blr</span>    <span style="color: #00bfff; font-weight: bold;">x1</span>
<span style="color: #daa520; font-weight: bold;">irq_stack_exit</span>
<span style="color: #00bfff; font-weight: bold;">.endm</span>
</pre>
</div>

<p>
irq_handler执行 <span class="underline">handle_arch_irq</span> 函数，该函数通过特殊的堆栈( <span class="underline">irq堆栈</span> )执行
</p>

<pre class="example" id="orgbb73d4e">
为什么有必要切换到其他堆栈？ 例如, 在RPI OS中, 没有这样做

但是如果不这么做, 将使用当前任务堆栈来处理中断, 而且永远无法确定当前任务堆栈中还有多少空间可以留给中断处理程序
</pre>

<p>
接下来, 需要查看 handle_arch_irq。虽然他看起来像一个变量，而不是一个函数，实际上他是一个函数指针，并在 <a href="https://github.com/torvalds/linux/blob/v4.14/arch/arm64/kernel/irq.c#L46">set_handle_irq</a> 函数中设置
</p>
</div>
</div>

<div id="outline-container-orgf6111c0" class="outline-3">
<h3 id="orgf6111c0">小结</h3>
<div class="outline-text-3" id="text-orgf6111c0">
<pre class="example" id="org3a2bc56">
至今为止已经研究了低级中断处理代码, 并从向量表一直跟踪到 handle_arch_irq ，这就是中断离开体系结构特定代码并开始由驱动程序代码处理的关键所在

下一个目标是通过驱动程序代码来追踪计时器中断
</pre>
</div>
</div>
</div>

<div id="outline-container-org7107abb" class="outline-2">
<h2 id="org7107abb">中断控制器</h2>
<div class="outline-text-2" id="text-org7107abb">
<pre class="example" id="org33e571a">
接下来将大量讨论Linux驱动程序以及它们如何处理中断
</pre>

<p>
先从驱动程序初始化代码开始, 然后看看 <a href="https://github.com/torvalds/linux/blob/v4.14/arch/arm64/kernel/irq.c#L44">handle_arch_irq</a> 函数 
</p>
</div>

<div id="outline-container-org9f8221a" class="outline-3">
<h3 id="org9f8221a">使用设备树查找所需的设备和驱动程序</h3>
<div class="outline-text-3" id="text-org9f8221a">
<pre class="example" id="org575fe2b">
在RPi OS中实现中断时, 一直在使用2种设备：系统定时器和中断控制器

现在, 我们的目标是了解相同设备在Linux中的工作方式

需要做的第一件事是找到负责使用提到的设备的驱动程序
</pre>

<p>
为了找到所需的驱动程序, 可以使用 <a href="https://github.com/torvalds/linux/blob/v4.14/arch/arm/boot/dots/bcm2837-rpi-3-b.dts">bcm2837-rpi-3-b.dts</a> 设备树文件：这是特定于Raspberry Pi 3 Model B的顶级设备树文件, 它包含其他更常见的设备树文件, 这些文件在不同版本的Raspberry Pi之间共享. 如果遵循包含的链并搜索 timer 和 interrupt-controller , 则可以找到4个设备：
</p>
<ul class="org-ul">
<li><a href="https://github.com/torvalds/linux/blob/v4.14/arch/arm/boot/dts/bcm2837.dtsi#L11">本地中断控制器</a></li>
<li><a href="https://github.com/torvalds/linux/blob/v4.14/arch/arm/boot/dts/bcm2837.dtsi#L20">本地计时器</a></li>
<li>全局中断控制器. 它被定义在 <a href="https://github.com/torvalds/linux/blob/v4.14/arch/arm/boot/dts/bcm283x.dtsi#L109">这里</a></li>
<li><a href="https://github.com/torvalds/linux/blob/v4.14/arch/arm/boot/dts/bcm283x.dtsi#L57">系统计时器</a></li>
</ul>

<pre class="example" id="org5a6fb73">
为什么有4个设备而不是2个？
</pre>
</div>
</div>

<div id="outline-container-org5579e12" class="outline-3">
<h3 id="org5579e12">本地与全局中断控制器</h3>
<div class="outline-text-3" id="text-org5579e12">
<pre class="example" id="orgfea0213">
考虑多处理器系统中的中断处理时, 应该问自己几个问题：

哪个内核应负责处理特定的中断？

发生中断时, 是全部4个内核都中断了, 还是只有一个？

是否可以将特定的中断路由到特定的内核？

可能想知道的另一个问题是, 如果一个处理器需要向其传递一些信息, 该处理器如何通知另一个处理器？
</pre>

<p>
<span class="underline">本地中断控制器</span> 是可以帮助回答所有这些问题的设备，它负责以下任务：
</p>
<ul class="org-ul">
<li>配置哪个内核应该接收特定的中断</li>
<li>在内核之间发送中断. 这样的中断称为 <span class="underline">mailboxs</span> , 并允许内核相互通信</li>
<li><p>
处理来自本地计时器和性能监视器中断(PMU)的中断
</p>

<pre class="example" id="org790d6f9">
BCM2836 ARM本地外围设备 手册中记录了本地中断控制器以及本地计时器的行为.

为什么我们在系统中需要两个独立的计时器？使用本地计时器的主要用例是当要配置所有4个内核以同时接收计时器中断时。如果使用系统定时器, 则只能将中断路由到单个内核.

使用RPi OS时, 既不使用本地中断控制器也不使用本地计时器：这是因为默认情况下, 本地中断控制器的配置方式是将所有外部中断都发送到第一个内核, 这正是我们所需要的. 所以没有使用本地计时器, 而是使用了系统计时器
</pre></li>
</ul>
</div>
</div>
