src/rpios/interrupt/linux.org
** 本地中断控制器
#+begin_example
根据 [[https://github.com/torvalds/linux/blob/v4.14/arch/arm/boot/dts/bcm2837.dtsi#L75][bcm2837.dtsi]] 全局中断控制器是本地中断控制器的子类型。 因此, 从本地控制器开始探索 
#+end_example

如果需要找到适用于特定设备的驱动程序, 则应使用 _compatible_ 属性。搜索该属性的值, 可以轻松地找到一个与RPi本地中断控制器兼容的[[https://github.com/torvalds/linux/blob/v4.14/drivers/irqchip/irq-bcm2836.c#L315][驱动程序]] 

#+begin_src sh 
  IRQCHIP_DECLARE(bcm2836_arm_irqchip_l1_intc, "brcm,bcm2836-l1-intc",
		  bcm2836_arm_irqchip_l1_intc_of_init);
#+end_src

内核遍历设备树中的所有设备定义, 并且针对每个定义, 它使用 compatible 属性寻找匹配的驱动程序。如果找到驱动程序, 则调用其初始化函数。在设备注册过程中提供了初始化函数, 在本例中, 此函数是 [[https://github.com/torvalds/linux/blob/v4.14/drivers/irqchip/irq-bcm2836.c#L280][bcm2836_arm_irqchip_l1_intc_of_init]]

#+begin_src c 
  static int __init bcm2836_arm_irqchip_l1_intc_of_init(struct device_node *node,
							struct device_node *parent)
  {
	  intc.base = of_iomap(node, 0);
	  if (!intc.base) {
		  panic("%pOF: unable to map local interrupt registers\n", node);
	  }

	  bcm2835_init_local_timer_frequency();

	  intc.domain = irq_domain_add_linear(node, LAST_IRQ + 1,
					      &bcm2836_arm_irqchip_intc_ops,
					      NULL);
	  if (!intc.domain)
		  panic("%pOF: unable to create IRQ domain\n", node);

	  bcm2836_arm_irqchip_register_irq(LOCAL_IRQ_CNTPSIRQ,
					   &bcm2836_arm_irqchip_timer);
	  bcm2836_arm_irqchip_register_irq(LOCAL_IRQ_CNTPNSIRQ,
					   &bcm2836_arm_irqchip_timer);
	  bcm2836_arm_irqchip_register_irq(LOCAL_IRQ_CNTHPIRQ,
					   &bcm2836_arm_irqchip_timer);
	  bcm2836_arm_irqchip_register_irq(LOCAL_IRQ_CNTVIRQ,
					   &bcm2836_arm_irqchip_timer);
	  bcm2836_arm_irqchip_register_irq(LOCAL_IRQ_GPU_FAST,
					   &bcm2836_arm_irqchip_gpu);
	  bcm2836_arm_irqchip_register_irq(LOCAL_IRQ_PMU_FAST,
					   &bcm2836_arm_irqchip_pmu);

	  bcm2836_arm_irqchip_smp_init();

	  set_handle_irq(bcm2836_arm_irqchip_handle_irq);
	  return 0;
  }
#+end_src
初始化函数采用2个参数：_node_ 和 _parent_ , 它们都是类型 _struct device_node_
+ node: 设备树中的当前节点, 在本例中, 它指向 [[https://github.com/torvalds/linux/blob/v4.14/arch/arm/boot/dts/bcm2837.dtsi#L11][这里]]
+ parent: 备树层次结构中的父节点, 对于本地中断控制器, 它指向 soc 元素
  #+begin_example
    soc 是最简单的总线, 可以直接映射所有设备寄存器到主内存
  #+end_example

节点可用于从当前设备树节点读取各种属性
#+begin_example
  例如, 函数 bcm2836_arm_irqchip_l1_intc_of_init 的第一行从 reg 读取设备基址属性

  但是, 此过程要复杂得多, 因为执行此功能时, 已启用MMU, 并且在能够访问物理内存的某个区域之前, 必须将该区域映射到某个虚拟地址
#+end_example

这正是 _of_iomap_ 函数的作用: 它 *读取* 提供的节点的 _reg_ 属性, 并将由reg属性描述的 _整个内存区域_ *映射* 到 _某个虚拟内存区域_ 

接下来调用 _bcm2835_init_local_timer_frequency_ 函数来初始化本地计时器的频率

#+begin_example
  此函数没有特别说明：它仅使用某些寄存器, 如BCM2836 ARM本地外围设备手册中所述, 以初始化本地计时器.
#+end_example

下一行需要一些解释：

#+begin_src c 
  intc.domain = irq_domain_add_linear(node, LAST_IRQ + 1,
				      &bcm2836_arm_irqchip_intc_ops,
				      NULL);
#+end_src

#+begin_example
  Linux为每个中断分配一个唯一的整数, 可以将此数字视为唯一的中断ID，每次想对中断执行操作时都会使用此ID(例如, 分配处理程序或分配哪个CPU应该处理它)

  每个中断还具有一个硬件中断号. 这通常是一个数字, 告诉触发了哪个中断线。BCM2837 ARM外设手册 的外设中断表位于第113页：以将此表中的索引视为硬件中断号

  显然 需要某种机制将Linux irq号映射到硬件irq号, 反之亦然

  如果只有一个中断控制器, 则可以使用一对一的映射, 但是通常情况下, 需要使用更复杂的机制
#+end_example

在Linux中 _struct irq_domain_ 实现了这种映射。每个中断控制器驱动程序应创建自己的irq域, 并注册该域可以处理的所有中断。注册函数返回Linux irq号, 该编号以后将用于处理中断

接下来的6行负责向irq域注册每个受支持的中断：

#+begin_src c 
  bcm2836_arm_irqchip_register_irq(LOCAL_IRQ_CNTPSIRQ,
				   &bcm2836_arm_irqchip_timer);
  bcm2836_arm_irqchip_register_irq(LOCAL_IRQ_CNTPNSIRQ,
				   &bcm2836_arm_irqchip_timer);
  bcm2836_arm_irqchip_register_irq(LOCAL_IRQ_CNTHPIRQ,
				   &bcm2836_arm_irqchip_timer);
  bcm2836_arm_irqchip_register_irq(LOCAL_IRQ_CNTVIRQ,
				   &bcm2836_arm_irqchip_timer);
  bcm2836_arm_irqchip_register_irq(LOCAL_IRQ_GPU_FAST,
				   &bcm2836_arm_irqchip_gpu);
  bcm2836_arm_irqchip_register_irq(LOCAL_IRQ_PMU_FAST,
				   &bcm2836_arm_irqchip_pmu);
#+end_src

根据BCM2836 ARM本地外设 本地中断控制器处理10种不同的中断:
+ 0-3是本地计时器的中断
+ 4-7是邮箱中断, 用于进程间通信
+ 8对应于全局中断控制器生成的所有中断
+ 中断9是性能监视器中断

[[https://github.com/torvalds/linux/blob/v4.14/drivers/irqchip/irq-bcm2836.c#L67][这里]] 会看到驱动程序定义了一组常量, 每个常量都包含 _硬件irq号_ 

#+begin_example
上面的注册代码注册所有中断, 但邮箱中断除外, 邮箱中断是单独注册的
#+end_example

为了更好地了解注册来看看 [[https://github.com/torvalds/linux/blob/v4.14/drivers/irqchip/irq-bcm2836.c#L154][bcm2836_arm_irqchip_register_irq]] 函数

#+begin_src c 
  static void bcm2836_arm_irqchip_register_irq(int hwirq, struct irq_chip *chip)
  {
	  int irq = irq_create_mapping(intc.domain, hwirq);

	  irq_set_percpu_devid(irq);
	  irq_set_chip_and_handler(irq, chip, handle_percpu_devid_irq);
	  irq_set_status_flags(irq, IRQ_NOAUTOEN);
  }
#+end_src

1. 执行实际的中断注册. [[https://github.com/torvalds/linux/blob/v4.14/kernel/irq/irqdomain.c#L632][irq_create_mapping]] 将硬件中断号作为输入并返回 Linux irq号
2. [[https://github.com/torvalds/linux/blob/v4.14/kernel/irq/irqdesc.c#L849][irq_set_percpu_devid]] 将中断配置为 *当前CPU* , 因此只能在当前处理器上处理本地中断
   #+begin_example
     因为现在讨论的所有中断都是本地中断, 因此所有中断只能在当前CPU上处理
   #+end_example
3. [[https://github.com/torvalds/linux/blob/v4.14/include/linux/irq.h#L608][irq_set_chip_and_handler]], 顾名思义, 设置irq芯片和irq处理程序
   + Irq芯片是一种特殊的结构, 需要由驱动程序创建, 该结构具有用于 _屏蔽_ 和 _取消屏蔽_ 特定中断的方法
     #+begin_example
       正在查看的驱动程序现在定义了3种不同的irq芯片: timer 芯片, PMU 芯片 和 GPU 芯片

       它控制由外部外围设备生成的所有中断
     #+end_example
   + 处理程序是负责处理中断的功能. 在这种情况下, 处理程序设置为通用 [[https://github.com/torvalds/linux/blob/v4.14/kernel/irq/chip.c#L859][handle_percpu_devid_irq]] 函数
     #+begin_example
	稍后, 该处理程序将由全局中断控制器驱动程序重写
     #+end_example
5. [[https://github.com/torvalds/linux/blob/v4.14/include/linux/irq.h#L652][irq_set_status_flags]] 在这种特殊情况下, 设置一个标志, 指示应手动启用当前中断, 并且默认情况下不应启用 

现在回到 bcm2836_arm_irqchip_l1_intc_of_init 函数, 只剩下两个调用. 第一个是 [[https://github.com/torvalds/linux/blob/v4.14/drivers/irqchip/irq-bcm2836.c#L243][bcm2836_arm_irqchip_smp_init]]  在此启用了邮箱中断, 从而允许处理器内核相互通信

最后一个函数调用非常重要：这是将 _低级异常处理代码_ *连接* 到 _驱动程序_ 的地方

#+begin_src c 
  set_handle_irq(bcm2836_arm_irqchip_handle_irq);
#+end_src

[[https://github.com/torvalds/linux/blob/v4.14/arch/arm64/kernel/irq.c#L46][set_handle_irq]] 是在特定于体系结构的代码中定义的, 从上面的行中可以了解到 [[https://github.com/torvalds/linux/blob/v4.14/drivers/irqchip/irq-bcm2836.c#L164][bcm2836_arm_irqchip_handle_irq]] 将由低级异常代码调用：

#+begin_src c 
  static void
  __exception_irq_entry bcm2836_arm_irqchip_handle_irq(struct pt_regs *regs)
  {
	  int cpu = smp_processor_id();
	  u32 stat;

	  stat = readl_relaxed(intc.base + LOCAL_IRQ_PENDING0 + 4 * cpu);
	  if (stat & BIT(LOCAL_IRQ_MAILBOX0)) {
  #ifdef CONFIG_SMP
		  void __iomem *mailbox0 = (intc.base +
					    LOCAL_MAILBOX0_CLR0 + 16 * cpu);
		  u32 mbox_val = readl(mailbox0);
		  u32 ipi = ffs(mbox_val) - 1;

		  writel(1 << ipi, mailbox0);
		  handle_IPI(ipi, regs);
  #endif
	  } else if (stat) {
		  u32 hwirq = ffs(stat) - 1;

		  handle_domain_irq(intc.domain, hwirq, regs);
	  }
  }
#+end_src

该函数读取 _LOCAL_IRQ_PENDING_ 寄存器, 以找出当前正在处理的中断

#+begin_example
  有4个 LOCAL_IRQ_PENDING 寄存器, 每个寄存器对应于其自己的处理器内核, 这就是为什么使用当前处理器索引来选择正确的寄存器的原因
#+end_example

邮箱中断和所有其他中断在if语句的2个不同子句中处理

#+begin_example
  多处理器系统的不同内核之间的交互超出了当前的讨论范围, 因此跳过邮箱中断处理部分
#+end_example

现在, 仅剩下以下两行没有解释：

#+begin_src c 
  u32 hwirq = ffs(stat) - 1;

			handle_domain_irq(intc.domain, hwirq, regs);
#+end_src

这是将中断传递给下一个处理程序的地方：
1. 首先计算硬件irq数，[[https://github.com/torvalds/linux/blob/v4.14/include/asm-generic/bitops/ffs.h#L13][ffs]] (Find first bit set) 函数用于执行此操作
2. [[https://github.com/torvalds/linux/blob/v4.14/kernel/irq/irqdesc.c#L622][handle_domain_irq]] 函数被调用：
   + 此函数使用irq域将硬件irq号码转换为Linux irq号码
   + 检查irq配置 (它存储在 [[https://github.com/torvalds/linux/blob/v4.14/include/linux/irqdesc.h#L55][irq_desc]] 结构)
   + 调用一个中断处理程序
     #+begin_example
       已经看到处理程序设置为 handle_percpu_devid_irq，但是, 此处理程序稍后将被子中断控制器覆盖。现在, 来检查一下这是如何发生的
     #+end_example

