html/rpios/interrupt/linux.html

<div id="outline-container-org578790e" class="outline-3">
<h3 id="org578790e">本地中断控制器</h3>
<div class="outline-text-3" id="text-org578790e">
<pre class="example" id="org2a33664">
根据 [[https://github.com/torvalds/linux/blob/v4.14/arch/arm/boot/dts/bcm2837.dtsi#L75][bcm2837.dtsi]] 全局中断控制器是本地中断控制器的子类型。 因此, 从本地控制器开始探索 
</pre>

<p>
如果需要找到适用于特定设备的驱动程序, 则应使用 <span class="underline">compatible</span> 属性。搜索该属性的值, 可以轻松地找到一个与RPi本地中断控制器兼容的<a href="https://github.com/torvalds/linux/blob/v4.14/drivers/irqchip/irq-bcm2836.c#L315">驱动程序</a> 
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #daa520; font-weight: bold;">IRQCHIP_DECLARE</span>(bcm2836_arm_irqchip_l1_intc, <span style="color: #deb887;">"brcm,bcm2836-l1-intc"</span>,
                bcm2836_arm_irqchip_l1_intc_of_init);
</pre>
</div>

<p>
内核遍历设备树中的所有设备定义, 并且针对每个定义, 它使用 compatible 属性寻找匹配的驱动程序。如果找到驱动程序, 则调用其初始化函数。在设备注册过程中提供了初始化函数, 在本例中, 此函数是 <a href="https://github.com/torvalds/linux/blob/v4.14/drivers/irqchip/irq-bcm2836.c#L280">bcm2836_arm_irqchip_l1_intc_of_init</a>
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #00bfff; font-weight: bold;">static</span> <span style="color: #98f5ff;">int</span> <span style="color: #daa520; font-weight: bold;">__init</span> bcm2836_arm_irqchip_l1_intc_of_init(<span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">device_node</span> *<span style="color: #4eee94;">node</span>,
                              <span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">device_node</span> *<span style="color: #4eee94;">parent</span>)
{
    intc.base = of_iomap(node, 0);
    <span style="color: #00bfff; font-weight: bold;">if</span> (!intc.base) {
        panic(<span style="color: #deb887;">"%pOF: unable to map local interrupt registers\n"</span>, node);
    }

    bcm2835_init_local_timer_frequency();

    intc.domain = irq_domain_add_linear(node, LAST_IRQ + 1,
                        &amp;bcm2836_arm_irqchip_intc_ops,
                        <span style="color: #ffd700;">NULL</span>);
    <span style="color: #00bfff; font-weight: bold;">if</span> (!intc.domain)
        panic(<span style="color: #deb887;">"%pOF: unable to create IRQ domain\n"</span>, node);

    bcm2836_arm_irqchip_register_irq(LOCAL_IRQ_CNTPSIRQ,
                     &amp;bcm2836_arm_irqchip_timer);
    bcm2836_arm_irqchip_register_irq(LOCAL_IRQ_CNTPNSIRQ,
                     &amp;bcm2836_arm_irqchip_timer);
    bcm2836_arm_irqchip_register_irq(LOCAL_IRQ_CNTHPIRQ,
                     &amp;bcm2836_arm_irqchip_timer);
    bcm2836_arm_irqchip_register_irq(LOCAL_IRQ_CNTVIRQ,
                     &amp;bcm2836_arm_irqchip_timer);
    bcm2836_arm_irqchip_register_irq(LOCAL_IRQ_GPU_FAST,
                     &amp;bcm2836_arm_irqchip_gpu);
    bcm2836_arm_irqchip_register_irq(LOCAL_IRQ_PMU_FAST,
                     &amp;bcm2836_arm_irqchip_pmu);

    bcm2836_arm_irqchip_smp_init();

    set_handle_irq(bcm2836_arm_irqchip_handle_irq);
    <span style="color: #00bfff; font-weight: bold;">return</span> 0;
}
</pre>
</div>
<p>
初始化函数采用2个参数：_node_ 和 <span class="underline">parent</span> , 它们都是类型 <span class="underline">struct device_node</span>
</p>
<ul class="org-ul">
<li>node: 设备树中的当前节点, 在本例中, 它指向 <a href="https://github.com/torvalds/linux/blob/v4.14/arch/arm/boot/dts/bcm2837.dtsi#L11">这里</a></li>
<li><p>
parent: 备树层次结构中的父节点, 对于本地中断控制器, 它指向 soc 元素
</p>
<pre class="example" id="orgbbd21e1">
soc 是最简单的总线, 可以直接映射所有设备寄存器到主内存
</pre></li>
</ul>

<p>
节点可用于从当前设备树节点读取各种属性
</p>
<pre class="example" id="org3fafe91">
例如, 函数 bcm2836_arm_irqchip_l1_intc_of_init 的第一行从 reg 读取设备基址属性

但是, 此过程要复杂得多, 因为执行此功能时, 已启用MMU, 并且在能够访问物理内存的某个区域之前, 必须将该区域映射到某个虚拟地址
</pre>

<p>
这正是 <span class="underline">of_iomap</span> 函数的作用: 它 <b>读取</b> 提供的节点的 <span class="underline">reg</span> 属性, 并将由reg属性描述的 <span class="underline">整个内存区域</span> <b>映射</b> 到 <span class="underline">某个虚拟内存区域</span> 
</p>

<p>
接下来调用 <span class="underline">bcm2835_init_local_timer_frequency</span> 函数来初始化本地计时器的频率
</p>

<pre class="example" id="orgdab070e">
此函数没有特别说明：它仅使用某些寄存器, 如BCM2836 ARM本地外围设备手册中所述, 以初始化本地计时器.
</pre>

<p>
下一行需要一些解释：
</p>

<div class="org-src-container">
<pre class="src src-c">intc.domain = irq_domain_add_linear(node, LAST_IRQ + 1,
                    &amp;bcm2836_arm_irqchip_intc_ops,
                    <span style="color: #ffd700;">NULL</span>);
</pre>
</div>

<pre class="example" id="orgfea11b5">
Linux为每个中断分配一个唯一的整数, 可以将此数字视为唯一的中断ID，每次想对中断执行操作时都会使用此ID(例如, 分配处理程序或分配哪个CPU应该处理它)

每个中断还具有一个硬件中断号. 这通常是一个数字, 告诉触发了哪个中断线。BCM2837 ARM外设手册 的外设中断表位于第113页：以将此表中的索引视为硬件中断号

显然 需要某种机制将Linux irq号映射到硬件irq号, 反之亦然

如果只有一个中断控制器, 则可以使用一对一的映射, 但是通常情况下, 需要使用更复杂的机制
</pre>

<p>
在Linux中 <span class="underline">struct irq_domain</span> 实现了这种映射。每个中断控制器驱动程序应创建自己的irq域, 并注册该域可以处理的所有中断。注册函数返回Linux irq号, 该编号以后将用于处理中断
</p>

<p>
接下来的6行负责向irq域注册每个受支持的中断：
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #daa520; font-weight: bold;">bcm2836_arm_irqchip_register_irq</span>(LOCAL_IRQ_CNTPSIRQ,
                 &amp;bcm2836_arm_irqchip_timer);
<span style="color: #daa520; font-weight: bold;">bcm2836_arm_irqchip_register_irq</span>(LOCAL_IRQ_CNTPNSIRQ,
                 &amp;bcm2836_arm_irqchip_timer);
<span style="color: #daa520; font-weight: bold;">bcm2836_arm_irqchip_register_irq</span>(LOCAL_IRQ_CNTHPIRQ,
                 &amp;bcm2836_arm_irqchip_timer);
<span style="color: #daa520; font-weight: bold;">bcm2836_arm_irqchip_register_irq</span>(LOCAL_IRQ_CNTVIRQ,
                 &amp;bcm2836_arm_irqchip_timer);
<span style="color: #daa520; font-weight: bold;">bcm2836_arm_irqchip_register_irq</span>(LOCAL_IRQ_GPU_FAST,
                 &amp;bcm2836_arm_irqchip_gpu);
<span style="color: #daa520; font-weight: bold;">bcm2836_arm_irqchip_register_irq</span>(LOCAL_IRQ_PMU_FAST,
                 &amp;bcm2836_arm_irqchip_pmu);
</pre>
</div>

<p>
根据BCM2836 ARM本地外设 本地中断控制器处理10种不同的中断:
</p>
<ul class="org-ul">
<li>0-3是本地计时器的中断</li>
<li>4-7是邮箱中断, 用于进程间通信</li>
<li>8对应于全局中断控制器生成的所有中断</li>
<li>中断9是性能监视器中断</li>
</ul>

<p>
<a href="https://github.com/torvalds/linux/blob/v4.14/drivers/irqchip/irq-bcm2836.c#L67">这里</a> 会看到驱动程序定义了一组常量, 每个常量都包含 <span class="underline">硬件irq号</span> 
</p>

<pre class="example" id="org77cd0e4">
上面的注册代码注册所有中断, 但邮箱中断除外, 邮箱中断是单独注册的
</pre>

<p>
为了更好地了解注册来看看 <a href="https://github.com/torvalds/linux/blob/v4.14/drivers/irqchip/irq-bcm2836.c#L154">bcm2836_arm_irqchip_register_irq</a> 函数
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #00bfff; font-weight: bold;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520; font-weight: bold;">bcm2836_arm_irqchip_register_irq</span>(<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">hwirq</span>, <span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">irq_chip</span> *<span style="color: #4eee94;">chip</span>)
{
    <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">irq</span> = irq_create_mapping(intc.domain, hwirq);

    irq_set_percpu_devid(irq);
    irq_set_chip_and_handler(irq, chip, handle_percpu_devid_irq);
    irq_set_status_flags(irq, IRQ_NOAUTOEN);
}
</pre>
</div>

<ol class="org-ol">
<li>执行实际的中断注册. <a href="https://github.com/torvalds/linux/blob/v4.14/kernel/irq/irqdomain.c#L632">irq_create_mapping</a> 将硬件中断号作为输入并返回 Linux irq号</li>
<li><p>
<a href="https://github.com/torvalds/linux/blob/v4.14/kernel/irq/irqdesc.c#L849">irq_set_percpu_devid</a> 将中断配置为 <b>当前CPU</b> , 因此只能在当前处理器上处理本地中断
</p>
<pre class="example" id="org1c2113e">
因为现在讨论的所有中断都是本地中断, 因此所有中断只能在当前CPU上处理
</pre></li>
<li><a href="https://github.com/torvalds/linux/blob/v4.14/include/linux/irq.h#L608">irq_set_chip_and_handler</a>, 顾名思义, 设置irq芯片和irq处理程序
<ul class="org-ul">
<li><p>
Irq芯片是一种特殊的结构, 需要由驱动程序创建, 该结构具有用于 <span class="underline">屏蔽</span> 和 <span class="underline">取消屏蔽</span> 特定中断的方法
</p>
<pre class="example" id="org895789e">
正在查看的驱动程序现在定义了3种不同的irq芯片: timer 芯片, PMU 芯片 和 GPU 芯片

它控制由外部外围设备生成的所有中断
</pre></li>
<li><p>
处理程序是负责处理中断的功能. 在这种情况下, 处理程序设置为通用 <a href="https://github.com/torvalds/linux/blob/v4.14/kernel/irq/chip.c#L859">handle_percpu_devid_irq</a> 函数
</p>
<pre class="example" id="org3e26685">
稍后, 该处理程序将由全局中断控制器驱动程序重写
</pre></li>
</ul></li>
<li><a href="https://github.com/torvalds/linux/blob/v4.14/include/linux/irq.h#L652">irq_set_status_flags</a> 在这种特殊情况下, 设置一个标志, 指示应手动启用当前中断, 并且默认情况下不应启用</li>
</ol>

<p>
现在回到 bcm2836_arm_irqchip_l1_intc_of_init 函数, 只剩下两个调用. 第一个是 <a href="https://github.com/torvalds/linux/blob/v4.14/drivers/irqchip/irq-bcm2836.c#L243">bcm2836_arm_irqchip_smp_init</a>  在此启用了邮箱中断, 从而允许处理器内核相互通信
</p>

<p>
最后一个函数调用非常重要：这是将 <span class="underline">低级异常处理代码</span> <b>连接</b> 到 <span class="underline">驱动程序</span> 的地方
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #daa520; font-weight: bold;">set_handle_irq</span>(bcm2836_arm_irqchip_handle_irq);
</pre>
</div>

<p>
<a href="https://github.com/torvalds/linux/blob/v4.14/arch/arm64/kernel/irq.c#L46">set_handle_irq</a> 是在特定于体系结构的代码中定义的, 从上面的行中可以了解到 <a href="https://github.com/torvalds/linux/blob/v4.14/drivers/irqchip/irq-bcm2836.c#L164">bcm2836_arm_irqchip_handle_irq</a> 将由低级异常代码调用：
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #00bfff; font-weight: bold;">static</span> <span style="color: #98f5ff;">void</span>
<span style="color: #daa520; font-weight: bold;">__exception_irq_entry</span> bcm2836_arm_irqchip_handle_irq(<span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">pt_regs</span> *<span style="color: #4eee94;">regs</span>)
{
    <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">cpu</span> = smp_processor_id();
    <span style="color: #98f5ff;">u32</span> <span style="color: #4eee94;">stat</span>;

    stat = readl_relaxed(intc.base + LOCAL_IRQ_PENDING0 + 4 * cpu);
    <span style="color: #00bfff; font-weight: bold;">if</span> (stat &amp; BIT(LOCAL_IRQ_MAILBOX0)) {
<span style="color: #ffd700;">#ifdef</span> CONFIG_SMP
        <span style="color: #98f5ff;">void</span> <span style="color: #4eee94;">__iomem</span> *mailbox0 = (intc.base +
                      LOCAL_MAILBOX0_CLR0 + 16 * cpu);
        <span style="color: #98f5ff;">u32</span> <span style="color: #4eee94;">mbox_val</span> = readl(mailbox0);
        <span style="color: #98f5ff;">u32</span> <span style="color: #4eee94;">ipi</span> = ffs(mbox_val) - 1;

        writel(1 &lt;&lt; ipi, mailbox0);
        handle_IPI(ipi, regs);
<span style="color: #ffd700;">#endif</span>
    } <span style="color: #00bfff; font-weight: bold;">else</span> <span style="color: #00bfff; font-weight: bold;">if</span> (stat) {
        <span style="color: #98f5ff;">u32</span> <span style="color: #4eee94;">hwirq</span> = ffs(stat) - 1;

        handle_domain_irq(intc.domain, hwirq, regs);
    }
}
</pre>
</div>

<p>
该函数读取 <span class="underline">LOCAL_IRQ_PENDING</span> 寄存器, 以找出当前正在处理的中断
</p>

<pre class="example" id="org1592a24">
有4个 LOCAL_IRQ_PENDING 寄存器, 每个寄存器对应于其自己的处理器内核, 这就是为什么使用当前处理器索引来选择正确的寄存器的原因
</pre>

<p>
邮箱中断和所有其他中断在if语句的2个不同子句中处理
</p>

<pre class="example" id="org39a63c0">
多处理器系统的不同内核之间的交互超出了当前的讨论范围, 因此跳过邮箱中断处理部分
</pre>

<p>
现在, 仅剩下以下两行没有解释：
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #98f5ff;">u32</span> <span style="color: #4eee94;">hwirq</span> = ffs(stat) - 1;

              <span style="color: #daa520; font-weight: bold;">handle_domain_irq</span>(intc.domain, hwirq, regs);
</pre>
</div>

<p>
这是将中断传递给下一个处理程序的地方：
</p>
<ol class="org-ol">
<li>首先计算硬件irq数，<a href="https://github.com/torvalds/linux/blob/v4.14/include/asm-generic/bitops/ffs.h#L13">ffs</a> (Find first bit set) 函数用于执行此操作</li>
<li><a href="https://github.com/torvalds/linux/blob/v4.14/kernel/irq/irqdesc.c#L622">handle_domain_irq</a> 函数被调用：
<ul class="org-ul">
<li>此函数使用irq域将硬件irq号码转换为Linux irq号码</li>
<li>检查irq配置 (它存储在 <a href="https://github.com/torvalds/linux/blob/v4.14/include/linux/irqdesc.h#L55">irq_desc</a> 结构)</li>
<li><p>
调用一个中断处理程序
</p>
<pre class="example" id="orgca333bf">
已经看到处理程序设置为 handle_percpu_devid_irq，但是, 此处理程序稍后将被子中断控制器覆盖。现在, 来检查一下这是如何发生的
</pre></li>
</ul></li>
</ol>
</div>
</div>
